---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StringerCurvesNotSplitStairs
source: html/cf86a46f-2d8f-a3ff-1247-95f4e7fa0567.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StringerCurvesNotSplitStairs Property

The slope of stringer may not parallel runs and landings. To get a parallel stringer, split boundary lines at the ends of landings.

## Syntax (C#)
```csharp
public static FailureDefinitionId StringerCurvesNotSplitStairs { get; }
```